driver-tests/bpelse/assign/VariablePropertyTest/BooleanCopyJBI/test/BooleanToBoolean/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:inc="http://j2ee.netbeans.org/wsdl/InCopyFrom" xmlns:sim="http://xml.netbeans.org/schema/simple">
  <soapenv:Body>
    <inc:InCopyFromOperation>
      <inputPart>
        <sim:itemElem>
          <sim:itemName>bpel</sim:itemName>
          <sim:price>3</sim:price>
          <sim:itemAvailable>false</sim:itemAvailable>
        </sim:itemElem>
      </inputPart>
    </inc:InCopyFromOperation>
  </soapenv:Body>
</soapenv:Envelope>